#include <iostream>
#include <conio.h>
#include "Scene.h"

const char* gameOverImage = R"(



       ####      #      #      #    ####        ###   #      #  ####   ###    
     ### ##     ##     ###     ##  #####      ### ##  ##    ## #####  ######  
    ##          ###    ###    ###  ##        ##     #  #    #  ##     ##   #  
    #          ## #    # #    # #  ##        #      #  #    #  ##     ##   #  
    #          #  #    # ##  ## #  #####     #      ## ##  ##  #####  ##   #  
    #   ####   #  ##   #  #  #  #  #####     #      ##  #  #   #####  #####   
    #     ##  ######   #  #  #  #  ##        #      ##  #  #   ##     ##  #   
    ##    ##  #    ##  #  ####  #  ##        ##     #   ####   ##     ##  ##  
     ##   ##  #     #  #   ##   #  ##         #    ##    ##    ##     ##   #  
      ###### #      #  #   ##   #  ######      #####     ##    ###### ##   ## 



                          THANK YOU FOR PLAYING !!!

                            PRESS C KEY TO TITLE
)";

const char* clearImage = R"(
            ########  ##         #########       ##        ########   
          ####   ##   ##         ########       ###        #########  
          ##          ##         ##             ####       ##     ### 
         ##           ##         ##            ## ##       ##      ## 
         ##           ##         ##            ##  ##      ##      ## 
        ###           ##         ##            ##  ##      ##     ### 
        ##            ##         ########     ##   ##      ##     ##  
        ##            ##         ########     ##    ##     ########   
        ##            ##         ##          ###    ##     #######    
        ###           ##         ##          ##########    ##   ###   
         ##           ##         ##          ##      ##    ##    ##   
         ##           ##         ##         ##       ##    ##     ##  
          ##          ##         ##         ##        ##   ##     ##  
          #########   #########  ########   ##        ##   ##      ## 
            #######   #########  ######### ##         ##   ##      ###


                          THANK YOU FOR PLAYING !!!

                            PRESS C KEY TO TITLE
)";

void Scene::Result() {
	std::system("cls");
	if (score < 50) {
        std::cout << gameOverImage;
	}
	else {
        std::cout << clearImage;
	}
	std::cout << "\n\n You've destroyed " << score << " enemies." << std::endl;
	int i; //“ü—Í
	do
	{
		i = _getch(); // ƒL[“ü—Í‘Ò‚¿
	} while ('c' != i);
	Title();
}